### Pandas Advance

#### 1. List any five functions of the pandas library with execution

And: Following are the few functions of pandas library:  
1.  **pandas.read_csv(): takes a csv file as input and converts into dataframe .Pandas has other functions to like read_excel,read_html, etc to read data and convert it to dataframe.**
2.  **data_frame.describe() : gives the descripive statistics of the data**
3.  **data_frame.info() : gives a concise summary of a DataFrame**
4.  **data_frame.head(n =5) : returns the first n rows of the dataframe ,5 is default value.**
5.  **data_frame.tail(n=5) : returns the last n rows of the dataframe,5 is default value.**

In [1]:
import pandas as pd

In [2]:
#pandas.read_csv()
df =pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
#describe()
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
#info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
#head()
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [6]:
#tail()
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

#### 2.  Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
#creating a dataframe

temp_data = {"A":[1,3,5],
            "B":[3,1,4],
            "C":[2,2,3]}

df1 =pd.DataFrame(temp_data)

In [8]:
df1

   A  B  C
0  1  3  2
1  3  1  2
2  5  4  3

In [9]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
df1.index = pd.RangeIndex(start=1,stop=7,step=2)

In [11]:
df1

   A  B  C
1  1  3  2
3  3  1  2
5  5  4  3

**3 .You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.**  

**For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.**

In [12]:
df2 = pd.DataFrame({
    "Col1": ["A","B","C","D","E"],
    "Values": [10, 20, 30, 40, 50]
})

In [13]:
df2

  Col1  Values
0    A      10
1    B      20
2    C      30
3    D      40
4    E      50

In [14]:
tot_sum = 0
for i,row in df2.head(3).iterrows():
    tot_sum += row["Values"]

In [15]:
print(f"The total sum of the first 3 rows: {tot_sum}")

The total sum of the first 3 rows: 60

In [16]:
#other method
tot_sum = df2.head(3)["Values"].sum()
print(f"The total sum of the first 3 rows: {tot_sum}")

The total sum of the first 3 rows: 60

4 . **Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column**

In [17]:
df = pd.DataFrame({"ID":[2,3,4],
                   "Text": ["Dhyan","Dhyanesh","Chetanya"]})

In [18]:
df

   ID      Text
0   2     Dhyan
1   3  Dhyanesh
2   4  Chetanya

In [19]:
#creating a function to count the characters in a string
def char_counter(str1):
    return len(str1)

In [20]:
#testing the function
char_counter("Dhyan")

5

In [21]:
#creating a new column using the map() function

df["Word_Count"] = df["Text"].map(char_counter)

In [22]:
df

   ID      Text  Word_Count
0   2     Dhyan           5
1   3  Dhyanesh           8
2   4  Chetanya           8

**5.  How are DataFrame.size() and DataFrame.shape() different?**

**Ans: The difference between DataFrame.size() and DataFrame.shape() is as follows:**  

**DataFrame.shape: It return a tuple representing the dimensionality of the DataFrame as (number of rows, number of columns)**  

**DataFrame.size: It return an int representing the number of elements in this object.It return the number of rows if Series. Otherwise return the number of rows times number of columns if DataFrame.**

In [23]:
df =pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [24]:
#shape returns (# rows,#columns)
df.shape

(891, 12)

In [25]:
#size returns = # rows * # columns
df.size

10692

**6. Which function of pandas do we use to read an excel file?**

**Ans: The read_excel() used to read excel files.It has parameters like sheet_name,header,names,index_col,etc.**

In [26]:
ex_df = pd.read_excel("quaterlyreport.xlsm",sheet_name="WEST RECORDS")

In [27]:
ex_df.head()

  Region               Dept   Jan   Feb   Mar  Total
0   West           Overhead   775   750   700   2225
1   West          Telephone   700   750   750   2200
2   West  Technical Support   300   100   150    550
3   West           Supplies  2000  1800  1900   5700
4   West        Maintenance  2000   950   800   3750

**7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.**  
**The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.**

In [28]:
df = pd.DataFrame({"Email": ["dhyanesh@gmail.com","dhyan@gmail.com"]})

In [29]:
df

                Email
0  dhyanesh@gmail.com
1     dhyan@gmail.com

In [30]:
df["Username"] = df["Email"].str.split("@",expand=True)[0]

In [31]:
df

                Email  Username
0  dhyanesh@gmail.com  dhyanesh
1     dhyan@gmail.com     dhyan

**8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.**

In [32]:
df = pd.DataFrame({"A":[3,8,6,2,9],
                  "B":[5,2,9,3,1],
                  "C":[1,7,4,5,2]})

In [33]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [34]:
#creating a function
def some_conditions(df):
    new_df = df[(df["A"] > 5) & (df["B"] < 10)]
    return new_df

In [35]:
new_df = some_conditions(df)

In [36]:
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

**9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.**

In [37]:
df = pd.DataFrame({"Values":[4,2,5,1,6,9,2,10,4,6]})

In [38]:
df

   Values
0       4
1       2
2       5
3       1
4       6
5       9
6       2
7      10
8       4
9       6

In [39]:
def stats(df):
    mean = df["Values"].mean()
    median = df["Values"].median()
    std = df["Values"].std()
    
    print(f"Mean : {mean}\nMedian : {median}\nstandard deviation : {std}")

In [40]:
stats(df)

Mean : 4.9
Median : 4.5
standard deviation : 2.960855732160327

**10.  Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day**

In [41]:
sales =[20,30,40,50,60,70,80,90,100,110,120,130,140,150,160]

df =pd.DataFrame({"Sales": sales , "Date": pd.date_range(start="2023-04-05",periods=15)})

In [42]:
df

    Sales       Date
0      20 2023-04-05
1      30 2023-04-06
2      40 2023-04-07
3      50 2023-04-08
4      60 2023-04-09
5      70 2023-04-10
6      80 2023-04-11
7      90 2023-04-12
8     100 2023-04-13
9     110 2023-04-14
10    120 2023-04-15
11    130 2023-04-16
12    140 2023-04-17
13    150 2023-04-18
14    160 2023-04-19

In [43]:
#we will use the rolling()  to create windows of size 7 an dcreate the moving averages uisng the mean() function on the windows.
def moving_avgs(df):
    ma = df["Sales"].rolling(window = 7,min_periods = 1)
    
    df["moving_average"]=ma.mean()

In [44]:
moving_avgs(df)

In [45]:
df

    Sales       Date  moving_average
0      20 2023-04-05            20.0
1      30 2023-04-06            25.0
2      40 2023-04-07            30.0
3      50 2023-04-08            35.0
4      60 2023-04-09            40.0
5      70 2023-04-10            45.0
6      80 2023-04-11            50.0
7      90 2023-04-12            60.0
8     100 2023-04-13            70.0
9     110 2023-04-14            80.0
10    120 2023-04-15            90.0
11    130 2023-04-16           100.0
12    140 2023-04-17           110.0
13    150 2023-04-18           120.0
14    160 2023-04-19           130.0

**11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.Monday, Tuesday) corresponding to each date in the 'Date' column.**

In [46]:
df = pd.DataFrame({"Date": pd.date_range(start="2023-01-01",periods=5)})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [47]:
def weekdays(df):
    df["Weeekday"] = df["Date"].dt.day_name()
    return df

In [48]:
new_df = weekdays(df)
new_df

        Date   Weeekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

**12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.**

In [49]:
df = pd.DataFrame({"Date" : pd.date_range(start="2023-01-01",end="2023-04-10",freq="15D")})

In [50]:
df

        Date
0 2023-01-01
1 2023-01-16
2 2023-01-31
3 2023-02-15
4 2023-03-02
5 2023-03-17
6 2023-04-01

In [51]:
def get_dates(df):
    new_df = df[(df["Date"] <= "2023-01-31") & (df["Date"] >= "2023-01-01")]
    return new_df

In [52]:
new_df = get_dates(df)
new_df

        Date
0 2023-01-01
1 2023-01-16
2 2023-01-31

**13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?**

**Ans: To use the basic functions of pandas, we need to import the pandas library/module itself first and foremost.**    
**Syntax: import pandas as pd.**